Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.SetInputPointsInfo(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPointInfo})
Sets the list of descption information used to select input points by some connections.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetInputPointsInfo
Returns a list of desciption information used to select input points by some connections.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetRangesOfApplicabilityBufferSize
Get the size of the ranges of applicability buffer.
Returns:
Returns the size of the ranges of applicability buffer.
Returns a value greater than 0 if there any ranges. Otherwise, returns 0.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetRangesOfApplicabilityBuffer(System.IntPtr,System.Int32)
Gets the ranges of applicability buffer from connection type.
rangesBuffer:
Ranges of applicability buffer.
rangesBufferSize:
The allocated size of the buffer. getRangesOfApplicabilityBufferSize() can be used to correctly instantiate this.
Returns:
Returns the size of ranges of applicability buffer.
Returns a value greater than 0 if there are any ranges and if it successfully copied the data. Otherwise, returns 0.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.SetRangesOfApplicabilityBuffer(System.IntPtr,System.Int32)
Sets the ranges of applicability buffer to the connection type.
rangesBuffer:
Ranges of applicability buffer.
rangesBufferSize:
Ranges of applicability buffer size.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetDetailedParametersBufferSize
Get the size of the detailed parameters buffer.
Returns:
Returns the size of the detailed parameters data buffer.
Returns a value greater than 0, if there is any detailed parameters data. Otherwise, returns 0.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetDetailedParameters(System.IntPtr,System.Int32)
Gets the detailed parameters from connection type.
params:
Detailed parameters buffer.
paramsBufferSize:
The allocated size of the buffer. getDetailedParametersBufferSize() can be used to correctly instantiate this.
Returns:
Returns the size of detailed parameters data buffer.
Returns a value greater than 0, if there is any detailed parameters data and it is succesfully allocated to provided buffer. Otherwise, returns 0.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.SetDetailedParameters(System.IntPtr,System.Int32,System.Boolean)
Sets the detailed parameters to the connection type.
params:
Detailed parameters buffer.
paramsBufferSize:
Detailed parameters buffer size.
updateConnections:
Specify if we have to update connections; for example when we check override params.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.FindGenericConnectionType(Autodesk.Revit.DB.Document)
Finds StructuralConnectionHandlerType which is Generic Connection type.
Returns:
Returns id of StructuralConnectionHandlerType which is Generic Connection type of invalidElementId if not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsTypeNameValidForCustomConnection(Autodesk.Revit.DB.Document,System.String)
Validates if the input name matches the criteria of StructuralConnectionHandlerType name.
Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\/:*?";<>| or any of the non-printable characters.
document:
The Document.
typeName:
The StructuralConnectionHandlerType name to validate.
Returns:
True if the input name matches the criteria of StructuralConnectionHandlerType name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.RemoveMainSubelementsFromCustomConnection(Autodesk.Revit.DB.Structure.StructuralConnectionHandler,System.Collections.Generic.IList{Autodesk.Revit.DB.Subelement})
Removes one or more subelements from a StructuralConnectionHandlerType. The subelements will be erased.
structuralConnectionHandler:
The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
subelements:
The main Subelements of input StructuralConnectionHandler which are to be used to modify custom StructuralConnectionHandlerType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input StructuralConnectionHandler must have custom type.
-or-
All the input Subelements must belong to input StructuralConnectionHandler.
After modification of StructuralConnectionHandlerType there must remain at least one subelement of structural connections category in StructuralConnectionHandler.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.AddElementsToCustomConnection(Autodesk.Revit.DB.Structure.StructuralConnectionHandler,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler by adding representors of input elements or subelements.
Remarks:
Elements or subelements added to a custom connection are deleted and transformed in subelements of the connection. They could be:
FamilyInstance (structural beams and columns).StructuralConnectionHandler elements associated to the connection.Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWeldsOST_StructConnectionHolesOST_StructConnectionModifiersOST_StructConnectionShearStudsOST_StructConnectionBoltsOST_StructConnectionAnchorsOST_StructConnectionPlates
You cannot add: elements connected by any connection handler, generic connections, holes and modifiers that are not on the connected elements.
structuralConnectionHandler:
The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
references:
References to elements or subelements which are to be used to modify custom StructuralConnectionHandlerType by adding their representors.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input StructuralConnectionHandler must have custom type.
-or-
All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections.
-or-
Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.Create(Autodesk.Revit.DB.Document,System.String,System.Guid,System.String,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPointInfo})
Creates a new StructuralConnectionHandlerType object.
pADoc:
The document.
name:
The type name.
guid:
Connection GUID.
familyName:
Name of system family which created type will belong to.
categoryId:
Category identity of connection type.
inputPointsInfo:
List of description information used for the selection of input points.
Returns:
The newly created instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.Create(Autodesk.Revit.DB.Document,System.String,System.Guid,System.String,Autodesk.Revit.DB.ElementId)
Creates a new StructuralConnectionHandlerType object.
pADoc:
The document.
name:
The type name.
guid:
Connection GUID.
familyName:
Name of system family which created type will belong to.
categoryId:
Category identity of connection type.
Returns:
The newly created instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.Create(Autodesk.Revit.DB.Document,System.String,System.Guid,System.String)
Creates a new StructuralConnectionHandlerType object.
pADoc:
The document.
name:
The type name.
guid:
Connection GUID.
familyName:
Name of system family which created type will belong to.
Returns:
The newly created instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetDefaultConnectionHandlerType(Autodesk.Revit.DB.Document)
Gets a default type id for Structural Connection.
pADoc:
The document.
Returns:
The type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.CreateDefaultStructuralConnectionHandlerType(Autodesk.Revit.DB.Document)
Creates a new StructuralConnectionHandlerType object with a default name.
pADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017